# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 2]],   # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],   # 1-P2/4

   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, ResUnit, [64]],      # 3
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, nn.MaxPool2d, [2, 2]],  # 5-P3/8

   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, ResUnit, [128]],     # 7
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, nn.MaxPool2d, [2, 2]],  # 9-P4/16

   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, ResUnit, [256]],        # 11
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, nn.MaxPool2d, [2, 2]],  # 13-P5/32
  ]

# TODO
# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [256, 1, 1]],    # 15
   [-1, 1, Conv, [512, 3, 1]],

   [-2, 1, Conv, [128, 1, 1]],    # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 11], 1, Concat, [1]],
   [-1, 1, Conv, [256, 3, 1]],  # 20 (P3/8-small)


   [[16, 20], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
